[
  [
    {
      "content": "Bonjour Docteur, j'ai subi une opération de la main la semaine dernière et je ressens encore beaucoup de douleur.",
      "fromUser": "patient"
    },
    {
      "content": "Bonjour, c'est normal d'avoir encore un peu de douleur après une opération. Pouvez-vous évaluer la douleur sur une échelle de 1 à 10 ?",
      "fromUser": "medecin"
    },
    { "content": "Je dirais que c'est environ un 7.", "fromUser": "patient" },
    {
      "content": "Avez-vous suivi les recommandations post-opératoires, comme prendre vos médicaments contre la douleur et éviter d'utiliser votre main ?",
      "fromUser": "medecin"
    },
    {
      "content": "Oui, j'ai pris mes médicaments et j'ai essayé de ne pas trop utiliser ma main, mais c'est difficile avec mon travail.",
      "fromUser": "patient"
    },
    {
      "content": "Il est important de donner à votre main le temps de guérir correctement. Je vous conseille de continuer à prendre vos médicaments comme prescrit et d'essayer de limiter l'utilisation de votre main autant que possible.",
      "fromUser": "medecin"
    },
    {
      "content": "D'accord, je vais essayer de faire plus attention. Merci Docteur.",
      "fromUser": "patient"
    },
    {
      "content": "De rien. Si la douleur ne diminue pas dans les prochains jours ou si vous remarquez des signes d'infection, comme une rougeur ou un gonflement accru, revenez me voir immédiatement.",
      "fromUser": "medecin"
    },
    {
      "content": "Je comprends, merci pour vos conseils. Bonne journée !",
      "fromUser": "patient"
    },
    {
      "content": "Bonne journée à vous aussi et bon rétablissement !",
      "fromUser": "medecin"
    }
  ],
  [
    {
      "content": "Bonjour, ici le service de messagerie de l'hôpital. Nous souhaitons recueillir vos impressions suite à votre récente intervention à la gorge. Pouvez-vous répondre à quelques questions?",
      "fromUser": "medecin"
    },
    { "content": "Bonjour, oui bien sûr.", "fromUser": "patient" },
    {
      "content": "Sur une échelle de 1 à 10, comment évalueriez-vous la qualité de votre chambre d'hôpital?",
      "fromUser": "medecin"
    },
    { "content": "Je dirais 8.", "fromUser": "patient" },
    {
      "content": "Merci. Sur une échelle de 1 à 10, comment évalueriez-vous la qualité de votre opération?",
      "fromUser": "medecin"
    },
    { "content": "9, tout s'est bien passé.", "fromUser": "patient" },
    {
      "content": "C'est excellent à entendre. Sur une échelle de 1 à 10, comment évalueriez-vous les soins post-opératoires?",
      "fromUser": "medecin"
    },
    {
      "content": "7, ils étaient bons mais pourraient être un peu plus attentifs.",
      "fromUser": "patient"
    },
    {
      "content": "Merci pour vos retours. Avez-vous des douleurs ou des préoccupations concernant votre récupération?",
      "fromUser": "medecin"
    },
    { "content": "Non, tout va bien pour l'instant.", "fromUser": "patient" },
    {
      "content": "Très bien. Si vous avez besoin de quoi que ce soit ou avez d'autres questions, n'hésitez pas à nous contacter. Bonne journée!",
      "fromUser": "medecin"
    },
    { "content": "Merci, bonne journée à vous aussi.", "fromUser": "patient" }
  ],
  [
    {
      "content": "Bonjour Docteur, j'ai des maux de tête persistants.",
      "fromUser": "patient"
    },
    {
      "content": "Bonjour, depuis combien de temps avez-vous ces maux de tête ?",
      "fromUser": "medecin"
    },
    { "content": "Depuis trois jours maintenant.", "fromUser": "patient" },
    {
      "content": "Avez-vous remarqué quelque chose qui pourrait les déclencher, comme le stress ou le manque de sommeil ?",
      "fromUser": "medecin"
    },
    {
      "content": "Oui, je suis très stressé au travail et je dors mal.",
      "fromUser": "patient"
    },
    {
      "content": "Je vous recommande de prendre du paracétamol et de vous reposer. Si les symptômes persistent, venez me voir pour une consultation.",
      "fromUser": "medecin"
    },
    {
      "content": "D'accord, merci Docteur. Sur une échelle de 1 à 10, je vous donnerais un 8 pour votre service.",
      "fromUser": "patient"
    },
    {
      "content": "Merci pour votre retour. Assurez-vous de bien vous reposer. Revenez me voir si nécessaire. Bonne journée !",
      "fromUser": "medecin"
    },
    { "content": "Merci, bonne journée à vous aussi !", "fromUser": "patient" }
  ],
  [
    {
      "content": "Docteur, j'ai une douleur au genou droit.",
      "fromUser": "patient"
    },
    {
      "content": "Pouvez-vous me dire quand cela a commencé et si c'est enflé ?",
      "fromUser": "medecin"
    },
    {
      "content": "Cela a commencé hier après une séance de sport. Mon genou est légèrement enflé.",
      "fromUser": "patient"
    },
    {
      "content": "Mettez de la glace sur votre genou et évitez de le solliciter. Prenez un anti-inflammatoire si nécessaire. Si la douleur persiste, consultez-moi en personne.",
      "fromUser": "medecin"
    },
    {
      "content": "Merci Docteur, je vais suivre vos conseils. Sur une échelle de 1 à 10, je dirais que la douleur est à 6.",
      "fromUser": "patient"
    },
    {
      "content": "Très bien. Surveillez l'évolution de la douleur. N'hésitez pas à me tenir informé si elle empire. Bon rétablissement !",
      "fromUser": "medecin"
    },
    { "content": "Merci beaucoup, Docteur !", "fromUser": "patient" }
  ],
  [
    {
      "content": "J'ai du mal à respirer depuis ce matin.",
      "fromUser": "patient"
    },
    {
      "content": "C'est sérieux. Avez-vous des antécédents d'asthme ou d'allergies ?",
      "fromUser": "medecin"
    },
    { "content": "Oui, j'ai de l'asthme.", "fromUser": "patient" },
    {
      "content": "Utilisez votre inhalateur immédiatement et allez à l'hôpital si cela ne s'améliore pas. Vous devez être vu par un professionnel de santé rapidement.",
      "fromUser": "medecin"
    },
    {
      "content": "Merci Docteur, je vais suivre vos instructions. Je donnerais un 9 pour votre service.",
      "fromUser": "patient"
    },
    {
      "content": "Je vous en prie. Assurez-vous de bien prendre soin de vous. Si vous avez d'autres préoccupations, n'hésitez pas à me contacter.",
      "fromUser": "medecin"
    },
    { "content": "D'accord, merci beaucoup !", "fromUser": "patient" }
  ],
  [
    {
      "content": "Je ressens une douleur aiguë dans le bas du dos.",
      "fromUser": "patient"
    },
    {
      "content": "Avez-vous soulevé quelque chose de lourd récemment ?",
      "fromUser": "medecin"
    },
    {
      "content": "Oui, j'ai aidé un ami à déménager ce week-end.",
      "fromUser": "patient"
    },
    {
      "content": "Il pourrait s'agir d'une tension musculaire. Reposez-vous, appliquez de la chaleur et prenez un analgésique si nécessaire. Si la douleur persiste ou s'aggrave, consultez-moi.",
      "fromUser": "medecin"
    },
    {
      "content": "D'accord, merci Docteur. Sur une échelle de 1 à 10, je dirais que la douleur est à 7.",
      "fromUser": "patient"
    },
    {
      "content": "Merci pour cette évaluation. Prenez soin de votre dos et évitez de porter des charges lourdes pour le moment. Revenez me voir si besoin.",
      "fromUser": "medecin"
    },
    { "content": "Merci beaucoup pour vos conseils !", "fromUser": "patient" }
  ],
  [
    {
      "content": "J'ai une éruption cutanée sur les bras.",
      "fromUser": "patient"
    },
    {
      "content": "Est-ce que ça démange ou brûle ? Avez-vous changé de produits cosmétiques récemment ?",
      "fromUser": "medecin"
    },
    {
      "content": "Ça démange beaucoup et j'ai utilisé une nouvelle lotion pour la peau.",
      "fromUser": "patient"
    },
    {
      "content": "Arrêtez d'utiliser la lotion et appliquez une crème antihistaminique. Si l'éruption ne disparaît pas en quelques jours, consultez-moi.",
      "fromUser": "medecin"
    },
    {
      "content": "D'accord, merci Docteur. Je donnerais un 7 pour votre service.",
      "fromUser": "patient"
    },
    {
      "content": "Merci pour votre retour. Tenez-moi au courant de l'évolution de votre peau. À bientôt !",
      "fromUser": "medecin"
    },
    { "content": "Merci beaucoup !", "fromUser": "patient" }
  ],
  [
    {
      "content": "Docteur, j'ai des vertiges quand je me lève.",
      "fromUser": "patient"
    },
    {
      "content": "Cela pourrait être lié à votre pression artérielle. Pouvez-vous la vérifier et me donner les résultats ?",
      "fromUser": "medecin"
    },
    {
      "content": "Ma pression est normale mais les vertiges persistent.",
      "fromUser": "patient"
    },
    {
      "content": "Buvez beaucoup d'eau et évitez de vous lever trop rapidement. Si les vertiges persistent, nous devrons faire des examens supplémentaires.",
      "fromUser": "medecin"
    },
    {
      "content": "Merci Docteur, je vais suivre vos conseils. Je vous donnerais un 9 pour votre service.",
      "fromUser": "patient"
    },
    {
      "content": "C'est gentil de votre part. Prenez soin de vous et revenez me voir si nécessaire. Bonne journée !",
      "fromUser": "medecin"
    },
    { "content": "Merci beaucoup !", "fromUser": "patient" }
  ],
  [
    {
      "content": "Je tousse beaucoup depuis trois jours.",
      "fromUser": "patient"
    },
    {
      "content": "Avez-vous de la fièvre ou d'autres symptômes comme des courbatures ?",
      "fromUser": "medecin"
    },
    { "content": "Non, juste la toux.", "fromUser": "patient" },
    {
      "content": "Buvez beaucoup de liquides et utilisez un sirop contre la toux. Si cela ne s'améliore pas en une semaine, consultez-moi.",
      "fromUser": "medecin"
    },
    {
      "content": "D'accord, merci Docteur. Sur une échelle de 1 à 10, je dirais que la toux est à 5.",
      "fromUser": "patient"
    },
    {
      "content": "Merci pour cette évaluation. Reposez-vous bien et prenez soin de votre santé. À bientôt !",
      "fromUser": "medecin"
    },
    { "content": "Merci beaucoup !", "fromUser": "patient" }
  ],
  [
    {
      "content": "Docteur, j'ai une douleur à l'estomac après avoir mangé.",
      "fromUser": "patient"
    },
    {
      "content": "Quels aliments avez-vous consommés avant l'apparition de la douleur ?",
      "fromUser": "medecin"
    },
    { "content": "Des plats épicés et gras.", "fromUser": "patient" },
    {
      "content": "Évitez les aliments épicés et gras pendant quelques jours et voyez si les symptômes s'améliorent. Prenez un antiacide si nécessaire.",
      "fromUser": "medecin"
    },
    {
      "content": "D'accord, merci Docteur. Je vous donnerais un 6 pour votre service.",
      "fromUser": "patient"
    },
    {
      "content": "Merci pour votre retour. Faites attention à votre alimentation et consultez-moi si les symptômes persistent.",
      "fromUser": "medecin"
    },
    { "content": "Merci beaucoup !", "fromUser": "patient" }
  ],
  [
    {
      "content": "Je sens une masse étrange sous mon bras gauche.",
      "fromUser": "patient"
    },
    {
      "content": "Cela pourrait être un ganglion lymphatique enflé. Est-ce douloureux ?",
      "fromUser": "medecin"
    },
    { "content": "Oui, un peu.", "fromUser": "patient" },
    {
      "content": "Cela peut être dû à une infection mineure. Si la masse ne diminue pas ou si vous avez d'autres symptômes, venez me voir pour un examen.",
      "fromUser": "medecin"
    },
    {
      "content": "D'accord, merci Docteur. Sur une échelle de 1 à 10, je dirais que la douleur est à 4.",
      "fromUser": "patient"
    },
    {
      "content": "Merci pour cette évaluation. Surveillez l'évolution et n'hésitez pas à me contacter si nécessaire.",
      "fromUser": "medecin"
    },
    { "content": "Merci beaucoup !", "fromUser": "patient" }
  ],
  [
    {
      "content": "J'ai des picotements dans les doigts depuis hier.",
      "fromUser": "patient"
    },
    {
      "content": "Avez-vous fait des activités répétitives ou stressé récemment ?",
      "fromUser": "medecin"
    },
    {
      "content": "Oui, j'ai travaillé longtemps sur mon ordinateur.",
      "fromUser": "patient"
    },
    {
      "content": "Faites des pauses régulières et étirez vos mains. Si les picotements persistent, nous devrons évaluer pour le syndrome du canal carpien.",
      "fromUser": "medecin"
    },
    {
      "content": "D'accord, merci Docteur. Sur une échelle de 1 à 10, je dirais que les picotements sont à 7.",
      "fromUser": "patient"
    },
    {
      "content": "Merci pour cette évaluation. Prenez soin de vos mains et consultez-moi si les symptômes persistent ou s'aggravent.",
      "fromUser": "medecin"
    },
    { "content": "Merci beaucoup !", "fromUser": "patient" }
  ],
  [
    {
      "content": "Docteur, j'ai des difficultés à dormir la nuit.",
      "fromUser": "patient"
    },
    {
      "content": "Avez-vous des soucis de stress ou changé votre routine de sommeil ?",
      "fromUser": "medecin"
    },
    {
      "content": "Oui, je suis très stressé au travail et je regarde souvent mon téléphone avant de dormir.",
      "fromUser": "patient"
    },
    {
      "content": "Essayez de limiter l'utilisation des écrans avant de dormir et adoptez une routine relaxante. Si cela ne s'améliore pas, nous pourrons explorer d'autres options.",
      "fromUser": "medecin"
    },
    {
      "content": "D'accord, merci Docteur. Je vous donnerais un 7 pour votre service.",
      "fromUser": "patient"
    },
    {
      "content": "Merci pour votre retour. Assurez-vous de bien suivre les conseils pour un sommeil réparateur. À bientôt !",
      "fromUser": "medecin"
    },
    { "content": "Merci beaucoup !", "fromUser": "patient" }
  ],
  [
    {
      "content": "J'ai une douleur à l'oreille droite.",
      "fromUser": "patient"
    },
    {
      "content": "Avez-vous récemment eu un rhume ou été exposé à un bruit fort ?",
      "fromUser": "medecin"
    },
    {
      "content": "Oui, j'ai eu un rhume la semaine dernière.",
      "fromUser": "patient"
    },
    {
      "content": "Cela pourrait être une otite. Utilisez des gouttes auriculaires et prenez un analgésique si nécessaire. Si la douleur persiste, venez me voir.",
      "fromUser": "medecin"
    },
    {
      "content": "D'accord, merci Docteur. Je vous donnerais un 8 pour votre service.",
      "fromUser": "patient"
    },
    {
      "content": "Merci pour votre évaluation. Assurez-vous de bien traiter votre oreille et surveillez les symptômes. À bientôt !",
      "fromUser": "medecin"
    },
    { "content": "Merci beaucoup !", "fromUser": "patient" }
  ],
  [
    {
      "content": "Docteur, ma vision est floue depuis ce matin.",
      "fromUser": "patient"
    },
    {
      "content": "Avez-vous des antécédents de problèmes de vision ou des symptômes comme des maux de tête ?",
      "fromUser": "medecin"
    },
    { "content": "Non, rien de particulier.", "fromUser": "patient" },
    {
      "content": "Reposez vos yeux et évitez les écrans pendant un moment. Si la vision ne s'améliore pas, il faudra consulter un ophtalmologiste.",
      "fromUser": "medecin"
    },
    {
      "content": "D'accord, merci Docteur. Sur une échelle de 1 à 10, je dirais que la gêne est à 5.",
      "fromUser": "patient"
    },
    {
      "content": "Merci pour cette évaluation. Prenez soin de vos yeux et consultez si nécessaire. À bientôt !",
      "fromUser": "medecin"
    },
    { "content": "Merci beaucoup !", "fromUser": "patient" }
  ],
  [
    {
      "content": "J'ai des douleurs dans la poitrine en respirant.",
      "fromUser": "patient"
    },
    {
      "content": "C'est potentiellement grave. Avez-vous d'autres symptômes comme des sueurs ou des nausées ?",
      "fromUser": "medecin"
    },
    { "content": "Non, juste la douleur.", "fromUser": "patient" },
    {
      "content": "Je vous conseille d'aller immédiatement à l'hôpital pour un examen approfondi.",
      "fromUser": "medecin"
    },
    {
      "content": "D'accord, merci Docteur. Je vous donnerais un 10 pour votre service.",
      "fromUser": "patient"
    },
    {
      "content": "Je vous remercie pour votre confiance. Allez immédiatement à l'hôpital pour être pris en charge. Bonne chance !",
      "fromUser": "medecin"
    },
    { "content": "Merci beaucoup !", "fromUser": "patient" }
  ],
  [
    {
      "content": "Je ressens une fatigue intense même après avoir bien dormi.",
      "fromUser": "patient"
    },
    {
      "content": "Avez-vous changé quelque chose dans votre alimentation ou vos habitudes récemment ?",
      "fromUser": "medecin"
    },
    { "content": "Non, rien de spécial.", "fromUser": "patient" },
    {
      "content": "Cela pourrait être dû à plusieurs facteurs. Reposez-vous bien et si la fatigue persiste, nous ferons des analyses pour en déterminer la cause.",
      "fromUser": "medecin"
    },
    {
      "content": "D'accord, merci Docteur. Sur une échelle de 1 à 10, je dirais que la fatigue est à 8.",
      "fromUser": "patient"
    },
    {
      "content": "Merci pour cette évaluation. Prenez soin de vous et consultez si la fatigue ne s'améliore pas. À bientôt !",
      "fromUser": "medecin"
    },
    { "content": "Merci beaucoup !", "fromUser": "patient" }
  ]
]
